HELYXcore-4.4.0/examples/tests/mesh/redistribution/mixerVesselAMI/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    ".*"
    {
        type           fixedValue;
        value          $internalField;
    }
    gasInlet
    {
        type           fixedValue;
        value          uniform (0 0 0.5);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    "(shaftRotating|stirrer)"
    {
        type            movingWallVelocity;
        value           $internalField;
    }
    shaft
    {
        type            rotatingWallVelocity;
        origin          (0 0 0);
        axis            (0 0 1);
        omega           -5;
    }
    "AMI.*"
    {
        type            cyclicAMI;
        value           $internalField;
    }
}


// ************************************************************************* //
