HELYXcore-4.4.0/examples/tests/mesh/redistribution/mixerVesselAMI/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1.25e5;

boundaryField
{
    ".*"
    {
        type            fixedFluxPressure;
    }
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }
    "AMI.*"
    {
        type            cyclicAMI;
        value           $internalField;
    }
}


// ************************************************************************* //
