HELYXcore-4.4.0/examples/tests/mesh/redistribution/mixerVesselAMI/system/decomposeParDict_6_parhip
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict_6_parhip;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  6;

method              parhip;

kahipCoeffs
{
    config      eco;
    imbalance   0.01;
    seed        0;
}

distributed         false;


// ************************************************************************* //
